Revit 2024 API
DisciplineTypeId.Energy Property
 Energy.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static ForgeTypeId Energy { get; }
Visual Basic
Public Shared ReadOnly Property Energy As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ Energy {
	ForgeTypeId^ get ();
}
See Also
DisciplineTypeId Class
Autodesk.Revit.DB Namespace